[
  { "name": "Stanley Kubrick", "tmdbId": 240, "slug": "kubrick", "description": "Obsessive perfectionist. Cold precision masking deep emotion. From war to space to horror, every frame a painting that stares back at you." },
  { "name": "Akira Kurosawa", "tmdbId": 5026, "slug": "kurosawa", "description": "The Emperor. Samurai epics, Shakespearean tragedy, and humanism so profound it transcends language. Influenced every filmmaker who came after." },
  { "name": "Alfred Hitchcock", "tmdbId": 2636, "slug": "hitchcock", "description": "The Master of Suspense. Voyeurism, paranoia, blonde women in peril. He didn't just make thrillers — he invented the grammar of fear." },
  { "name": "Martin Scorsese", "tmdbId": 1032, "slug": "scorsese", "description": "Mean streets, goodfellas, and the dark soul of America. No one films violence, guilt, and redemption with more ferocity or tenderness." },
  { "name": "Francis Ford Coppola", "tmdbId": 1776, "slug": "coppola", "description": "The Godfather trilogy, Apocalypse Now, The Conversation. When he aimed for the moon, he hit it — and changed cinema forever." },
  { "name": "Andrei Tarkovsky", "tmdbId": 8452, "slug": "tarkovsky", "description": "Time sculpted in light and water. The most spiritual filmmaker who ever lived. Each film a meditation that demands surrender." },
  { "name": "Ingmar Bergman", "tmdbId": 6648, "slug": "bergman", "description": "Death plays chess, God stays silent, and love is the only answer that isn't enough. The philosopher-poet of cinema's deepest questions." },
  { "name": "Federico Fellini", "tmdbId": 4415, "slug": "fellini", "description": "Dreams made flesh. Carnival grotesques and tender romantics inhabit a cinema so personal it became its own adjective: Felliniesque." },
  { "name": "David Lynch", "tmdbId": 5602, "slug": "lynch", "description": "Don't try to understand it. Feel it. Suburban nightmares, industrial drones, and the sinister beauty hiding behind every white picket fence." },
  { "name": "David Fincher", "tmdbId": 7467, "slug": "fincher", "description": "Meticulous, obsessive, relentless. Dark rooms and darker truths. Every cut, every shadow, every sound designed to unsettle." },
  { "name": "Paul Thomas Anderson", "tmdbId": 4762, "slug": "pta", "description": "Epic American tapestries woven from loneliness, ambition, and yearning. From Boogie Nights to There Will Be Blood — sprawling, intimate, and unmistakable." },
  { "name": "Denis Villeneuve", "tmdbId": 137427, "slug": "villeneuve", "description": "Quiet devastation and staggering scale. From intimate thrillers to sci-fi epics, he makes the impossible feel tactile and the human feel cosmic." },
  { "name": "Christopher Nolan", "tmdbId": 525, "slug": "nolan", "description": "Time as puzzle, spectacle as philosophy. The blockbuster auteur who proved you can bend audiences' minds and break box office records simultaneously." },
  { "name": "Bong Joon-ho", "tmdbId": 21684, "slug": "bong-joon-ho", "description": "Genre-smasher. Social satirist. The man who made the whole world watch a Korean film about stairs. Every movie a Trojan horse of ideas." },
  { "name": "Park Chan-wook", "tmdbId": 10099, "slug": "park-chan-wook", "description": "Vengeance as art form, violence as ballet. Baroque, romantic, and absolutely savage — cinema that grabs you by the throat and doesn't let go." },
  { "name": "Wong Kar-wai", "tmdbId": 12453, "slug": "wong-kar-wai", "description": "Heartbreak in neon. Cigarette smoke and slow motion. The loneliest, most beautiful films ever made about love that almost happened." },
  { "name": "Hayao Miyazaki", "tmdbId": 608, "slug": "miyazaki", "description": "The master of animated cinema. Ecological fables, flying machines, and childhood wonder rendered with a hand-drawn beauty that no algorithm can replicate." },
  { "name": "Wes Anderson", "tmdbId": 5655, "slug": "wes-anderson", "description": "Symmetrical frames, pastel palettes, and melancholy hiding behind whimsy. A miniaturist whose dollhouse worlds contain real, aching hearts." },
  { "name": "Joel Coen", "tmdbId": 1223, "slug": "coen-brothers", "description": "America's greatest filmmaking duo. Fargo, No Country, The Big Lebowski. Dark comedy, darker philosophy, and dialogue sharp enough to cut glass." },
  { "name": "Sofia Coppola", "tmdbId": 1769, "slug": "sofia-coppola", "description": "Isolation as aesthetic. Lost in Translation, The Virgin Suicides, Marie Antoinette. Loneliness has never looked so luminous or sounded so good." },
  { "name": "Steven Spielberg", "tmdbId": 488, "slug": "spielberg", "description": "The most commercially successful director alive who is also a genuine artist. From Jaws to Schindler's List, he defined what movies can make you feel." },
  { "name": "Billy Wilder", "tmdbId": 3146, "slug": "billy-wilder", "description": "The greatest screenwriter-director who ever lived. Sunset Boulevard, The Apartment, Some Like It Hot. He invented modern comedy and noir in the same career." },
  { "name": "Orson Welles", "tmdbId": 40, "slug": "orson-welles", "description": "Citizen Kane at 25. He invented modern filmmaking, then spent the rest of his life fighting the system he'd outgrown. Every shot a revolution." },
  { "name": "Ridley Scott", "tmdbId": 578, "slug": "ridley-scott", "description": "A visual architect whose films defined entire genres. Alien, Blade Runner, Gladiator — each one a world so complete you can smell the air." },
  { "name": "Terrence Malick", "tmdbId": 30715, "slug": "terrence-malick", "description": "The most singular poetic voice in American cinema. Whispered narration, golden-hour light, and a camera that moves like prayer through a broken world." },
  { "name": "Pedro Almodovar", "tmdbId": 309, "slug": "almodovar", "description": "Spain's greatest living filmmaker. Melodrama, desire, and identity in technicolor. All About My Mother, Talk to Her, Volver — passion as a way of life." },
  { "name": "Spike Lee", "tmdbId": 5281, "slug": "spike-lee", "description": "Do the Right Thing. Malcolm X. BlacKkKlansman. An essential American voice — fiery, inventive, politically unafraid, and cinematically restless." },
  { "name": "Werner Herzog", "tmdbId": 6818, "slug": "werner-herzog", "description": "The madman of world cinema. Aguirre, Fitzcarraldo, Grizzly Man. He drags cameras into places no sane person would go, and brings back truth." },
  { "name": "Sergio Leone", "tmdbId": 4385, "slug": "sergio-leone", "description": "He didn't just make westerns — he turned them into opera. The Good, the Bad and the Ugly. Once Upon a Time in the West. Cinema as myth." },
  { "name": "Michael Mann", "tmdbId": 638, "slug": "michael-mann", "description": "The poet laureate of nocturnal cities. Heat, Collateral, The Insider. Obsessive professionals, digital gunfire, and Los Angeles at 2 AM." },
  { "name": "Yorgos Lanthimos", "tmdbId": 122423, "slug": "lanthimos", "description": "The most important European auteur of the last decade. The Lobster, The Favourite, Poor Things. Absurdist, unsettling, wickedly funny, and brilliant." },
  { "name": "Abbas Kiarostami", "tmdbId": 119294, "slug": "kiarostami", "description": "The towering figure of Iranian cinema. Taste of Cherry, Close-Up, Certified Copy. Simple surfaces hiding infinite philosophical depth." },
  { "name": "Lars von Trier", "tmdbId": 42, "slug": "lars-von-trier", "description": "Love him or hate him, he's essential. Melancholia, Dancer in the Dark, Breaking the Waves. A provocateur who makes you feel things you'd rather not." }
]
